README.org
:PROPERTIES:
:header-args:elisp: :tangle init.el :results silent
:END:
#+title: Emacs Configure
#+author: ryo
#+name: everything-has-a-start
#+headers: :exports none
#+begin_src elisp
  ;;; init.el --- Emacs Configuration File -*- lexical-binding: t -*-
  ;;; Commentary:
#+end_src

* First Init
** Debug
#+name: debug-on-err
#+begin_src elisp
  ;; Enable debug when encounter errors
  (setf debug-on-error nil)
  (setf warning-minimum-level :error)
#+end_src

** Basic Looking
*** For macOS
#+name: basic-looking-macos
#+begin_src elisp
  (when (eq system-type 'darwin)
    ;; font scale and fonts
    (cond
     ((find-font (font-spec :family "Unifont"))
      (set-face-attribute 'default nil
                          :font "Unifont"
                          :height 160))
     ((find-font (font-spec :family "Sarasa Term SC"))
      (set-face-attribute 'default nil
                           :family "Sarasa Term SC"
                           :height 160))
     (t (set-face-attribute :height 130)))

    ;; Set for how default frame looks like
    (setq default-frame-alist '((menu-bar-lines . nil)
                                (tool-bar-lines . nil)
                                (vertical-scroll-bars . nil)))

    ;; pixel scroll mode
    (pixel-scroll-precision-mode t)

    ;; I am using yabai
    (when (executable-find "yabai")
      (setf frame-resize-pixelwise t)
      (add-to-list 'default-frame-alist '(undecorated . t))))
#+end_src

*** For Linux
#+name: basic-looking-linux
#+begin_src elisp
  (when (eq system-type 'gnu/linux)
    ;; font scale
    (set-face-attribute 'default nil :height 130)

    ;; set for default frame
    (setq default-frame-alist '((menu-bar-lines . nil)
                                (tool-bar-lines . nil)))

    ;; pixel scroll mode
    (pixel-scroll-precision-mode))
#+end_src

** Indention
#+name: indention-with-space
#+begin_src elisp
  ;; Use space by default instead of tab for indention
  (setq-default indent-tabs-mode nil)

  ;; Use 2 whitespace for indention rather than tabs
  (setq-default tab-width 2)
#+end_src

** Autosave and Backups
#+name: ensure-dir
#+begin_src elisp
  (defun ryo:ensure-dir (path)
    "Make sure `path' is existing."
    (unless (file-exists-p path)
      (make-directory path t)))
#+end_src

#+name: autosaves-settings
#+begin_src elisp
  (defvar ryo:autosaves-dir
    (expand-file-name "autosaves" user-emacs-directory)
    "All autosaves files goes into `ryo:autosaves-dir'.")

  ;; make `ryo:autosaves-dir' if it's not exists
  (ryo:ensure-dir ryo:autosaves-dir)

  (setf auto-save-file-name-transforms
        `(("\(?:[^/]/\)\(.*\)" ,(expand-file-name "\\1" ryo:autosaves-dir) t)))

  (setf auto-save-default t
        auto-save-timeout 10   ; second
        auto-save-interval 100 ; after 233 input events, trigger autosave
        )
#+end_src

#+name: backup-settings
#+begin_src elisp
  (defvar ryo:backups-dir
    (expand-file-name "backups" user-emacs-directory)
    "All backup file goes into `ryo:backups-dir'.")

  ;; make `ryo:backups-dir' if it's not exists
  (ryo:ensure-dir ryo:backups-dir)

  ;; All backups shall be stored into `backups' folder
  (setf backup-directory-alist `((".*" . ,ryo:backups-dir)))
#+end_src

Ref: [[https://snarfed.org/gnu_emacs_backup_files][gnu emacs backup files]]

* Pre-Custom
#+name: pre-custom
#+begin_src elisp
  (load-file (expand-file-name "pre-custom.el" user-emacs-directory))
#+end_src

* Packages
#+name: init-packages
#+begin_src elisp
  (require 'package)
  (package-initialize)

  ;; not refresh every time for quicker start up time
  ;; (package-refresh-contents)

  ;; use-package was built in after emacs 29
  (when (version< emacs-version "29")
    (package-install 'use-package))

  (require 'use-package)

  ;; Always ensure the package
  (setq use-package-always-ensure t)
#+end_src

#+name: org-mode
#+begin_src elisp :noweb yes
  ;; Note: this is a dirty patch to use enhanced latex preview org mode
  ;; I should change this in the future, but this did make the org mode
  ;; load before emacs org. 
  (use-package org
    :load-path "org-mode/lisp"
    :config
    <<ryo:org-babel>>
    <<ryo:org-preview>>
    <<ryo:org-latex-config>>
    )
#+end_src

** Yasnippet
#+name: yasnippet
#+begin_src elisp
  (use-package yasnippet
    :load-path "yasnippet"
    :config
    (defvar ryo:yas-snippet-path
      (expand-file-name "snippets" user-emacs-directory)
      "Path of snippet dirs (synced with git).")

    (defvar ryo:yas-snippet-path-local-only
      (expand-file-name "local-snippets" user-emacs-directory)
      "Path of local only snippets (not synced with git).")

    (ryo:ensure-dir ryo:yas-snippet-path)
    (ryo:ensure-dir ryo:yas-snippet-path-local-only)

    (setq yas-snippet-dirs
          (list ryo:yas-snippet-path
                ryo:yas-snippet-path-local-only))

    (yas-global-mode 1))
#+end_src

** Editing
*** Autopair
#+name: autopair-pars
#+begin_src elisp
  (electric-pair-mode 1)
#+end_src

*** Puni
#+name: puni
#+begin_src elisp
  (use-package puni
    :load-path "puni"
    :config
    (puni-global-mode))
#+end_src

*** atomic-chrome
#+name: atomic-chrome
#+begin_src elisp
  (use-package atomic-chrome
    :load-path "atomic-chrome"
    :config
    (atomic-chrome-start-server)
    (setf atomic-chrome-default-major-mode 'markdown-mode))
#+end_src

** Project Management
*** Blink-Search
#+name: blink-search
#+begin_src elisp
  (use-package blink-search
    :load-path "blink-search"
    :bind ("C-s" . blink-search)
    :custom ((blink-search-enable-posframe       t)
             (blink-search-posframe-standalone   nil)
             (blink-search-posframe-width-ratio  0.8)
             (blink-search-posframe-height-ratio 0.6))
    :config
    ;; Note: change how the posframe is shown
    (defun blink-search-posframe-show (buffer)
      (let* ((posframe-height (round (* (frame-height) blink-search-posframe-height-ratio)))
             (posframe-width  (round (* (frame-width) blink-search-posframe-width-ratio))))
        (apply #'posframe-show
               (get-buffer buffer)
               :poshandler #'posframe-poshandler-frame-bottom-center
               (list
                :max-height (frame-height)
                :min-height posframe-height
                :min-width  posframe-width
                :max-width  (frame-width)
                :border-width 2
                :border-color "gray"
                :accept-focus (equal buffer blink-search-input-buffer)
                )))))
#+end_src

*** Magit
#+name: magit
#+begin_src elisp
  (use-package magit
    :load-path "magit")
#+end_src

*** Emojishell
#+name: emojishell
#+begin_src elisp
  (use-package emojishell
    :load-path "emojishell"
    :config
    (setf eshell-prompt-function #'emojishell-emoji-prompt))
#+end_src

*** Dirvish
#+name: dirvish
#+begin_src elisp
  (use-package dirvish
    :load-path "dirvish"
    :config
    (dirvish-override-dired-mode))
#+end_src

** Lisp
