README.org
*** SLY
#+name: lisp-sly
#+begin_src elisp
  (use-package sly
    :load-path "sly"
    :config
    (require 'sly-autoloads)

    ;; org-mode babel
    (setf org-babel-lisp-eval-fn #'sly-eval)

    ;; sbcl with larger dynamic space size
    (setf inferior-lisp-program '("sbcl" "--dynamic-space-size" "4GB"))

    ;; add sly-mrepl hook for C-return
    (defun ryo:register-sly-mrepl-key-map ()
      (require 'sly-mrepl)
      (define-key sly-mrepl-mode-map (kbd "RET") nil)
      (define-key sly-mrepl-mode-map (kbd "C-<return>") #'sly-mrepl-return)
      (define-key sly-mrepl-mode-map (kbd "S-<return>") #'sly-mrepl-return))
    (add-hook 'sly-mrepl-mode-hook 'ryo:register-sly-mrepl-key-map)

    ;; some help keys
    (define-key lisp-mode-map (kbd "C-l v") #'sly-describe-symbol)
    (define-key lisp-mode-map (kbd "C-l f") #'sly-describe-function)
    (define-key lisp-mode-map (kbd "C-l c") #'sly-who-calls)
    (define-key lisp-mode-map (kbd "C-l b") #'sly-who-binds))
#+end_src

*** Complete Box
Note: I will using company right now til I found something better
than company-mode.

#+name: company-mode
#+begin_src elisp
  (use-package company
    :hook (((lisp-mode sly-mrepl-mode) . company-mode)))

  ;; company with posframe for better UI
  (use-package company-posframe
    :hook (((company-mode) . company-posframe-mode)))
#+end_src

*** April (APL)
#+name: april
#+begin_src elisp
  (use-package gnu-apl-mode
    :load-path "gnu-apl-mode"
    :config
    (let ((last-output ""))
      (defun org-babel-gnu-apl-capture-output (raw-output)
        (setf last-output (car (string-split raw-output ""))))
      (defun org-babel-execute:gnu-apl (body params)
        (with-temp-buffer
          (gnu-apl-mode)
          (insert body)
          (gnu-apl-interactive-send-string body)
          (gnu-apl-interactive-send-string "⊣⍬\n")
          (mapcar #'split-string (string-split last-output "\n")))))  

    (add-hook 'gnu-apl-interactive-mode-hook
              (lambda ()
                (add-hook 'comint-output-filter-functions
                          'org-babel-gnu-apl-capture-output
                          nil 'local)))

    (defvar org-babel-default-header-args:gnu-apl
      '((:results . "table") (:exports . "results"))
      "Default arguments to use when evaluating a GNU APL source block. "))
#+end_src

** COMMENT C Programming Language
*** Irony
#+name: irony
#+begin_src elisp
  (use-package irony
    :hook (((c++-mode c-mode) . irony-mode)
           ((c++-mode c-mode) . lsp)))

  (use-package flycheck-irony
    :after (irony))

  (use-package irony-eldoc
    :hook ((irony-mode . irony-eldoc))
    :after (irony))
#+end_src

** LSP
#+name: lsp-bridge
#+begin_src elisp
  (use-package lsp-bridge
    :load-path "lsp-bridge"
    :custom ((lsp-bridge-enable-org-babel t)
             (lsp-bridge-enable-hover-diagnostic t))
    :config

    ;; acm key binding
    (define-key acm-mode-map [tab] nil)
    (define-key acm-mode-map "\t"  nil)

    (global-lsp-bridge-mode))
#+end_src

** Python
*** Org-Babel
#+name: org-babel-python-command
#+begin_src elisp
  ;; Ensure Python Command
  (setf org-babel-python-command
        (cond ((executable-find "python3") "python3")
              ((executable-find "python2") "python2")
              (t "python")))
#+end_src

*** Misc
#+name: misc-about-python
#+begin_src elisp
  (setf python-indent-guess-indent-offset nil)
#+end_src

** Other Programming Language
*** COMMENT ROOT
#+name: root
#+begin_src elisp
  (use-package cern-root-mode
    :config
    (setf cern-root-filepath (executable-find "root")))
#+end_src

*** Verilog
#+name: verilog
#+begin_src elisp
  (use-package verilog-mode)

  (use-package verilog-ext
    :hook ((verilog-mode . verilog-ext-mode))
    :init
    (setf verilog-ext-feature-list
          '(font-lock
            xref
            capf
            hierarchy
            eglot
            lsp
            flycheck
            beautify
            navigation
            template
            formatter
            compilation
            imenu
            which-func
            hideshow
            typedefs
            time-stamp
            block-end-comments
            ports))
    :config
    (defconst verilog-ext-block-end-keywords-complete-re
      (concat
       ; Blanks and block end keyword
       "^\\(?1:\\s-*" verilog-ext-block-end-keywords-re "\\)\\s-*"
       ; Comments
       ":\\s-*\\(\\(block:\\|" verilog-identifier-sym-re "\\s-*::\\)\\s-*\\)*"
       ; Block name to be replaced
       "\\(?2:" verilog-identifier-sym-re "\\)\\s-*$"))                 

    (defun verilog-ext-block-end-comments-to-names ()
      "Convert valid block-end comments to ': BLOCK_NAME'.

  Examples: endmodule // module_name             → endmodule : module_name
            endfunction // some comment          → endfunction // some comment
            endfunction // class_name::func_name → endfunction : func_name
            end // block: block_name             → end : block_name"
      (interactive)
      (save-excursion
        (goto-char (point-min))
        (while (re-search-forward verilog-ext-block-end-keywords-complete-re nil :noerror)
          (when (not (member (match-string-no-properties 2) verilog-keywords))
            (replace-match "\\1 // \\2")))))

    (verilog-ext-mode-setup))
#+end_src

*** COMMENT Swift
#+name: swift
#+begin_src elisp
  (use-package swift-mode
    :hook ((swift-mode . lsp)))

  (use-package lsp-sourcekit
    :after (lsp-mode)
    :config
    (when (eq system-type 'darwin)
      (setf lsp-sourcekit-executable
            (string-trim (shell-command-to-string "xcrun --find sourcekit-lsp")))))
#+end_src

** For Editing Documents
*** Emacs Rime
#+name: emacs-rime
#+begin_src elisp
  (use-package rime
    :load-path "emacs-rime"
    :custom (default-input-method "rime")
    :config
    (setf rime-user-data-dir  (expand-file-name "rime-ice" user-emacs-directory)
          rime-show-candidate 'posframe)
    (setf rime-disable-predicates
          '(rime-predicate-after-alphabet-char-p
            rime-predicate-punctuation-after-ascii-p
            rime-predicate-org-latex-mode-p
            rime-predicate-prog-in-code-p          
            rime-predicate-tex-math-or-command-p
            rime-predicate-space-after-cc-p
            rime-predicate-in-code-string-p
            rime-predicate-in-code-string-after-ascii-p))
    (when (eq system-type 'darwin)
      (setf rime-librime-root
            (expand-file-name "librime/dist" user-emacs-directory))
      (setf rime-emacs-module-header-root
            "/opt/homebrew/opt/emacs-plus@29/include")))
#+end_src

*** COMMENT Smart Input Sources
#+name: sis
#+begin_src elisp
  (use-package sis
    :load-path "emacs-smart-input-source"
    :config
    (sis-ism-lazyman-config nil "rime" 'native)  

    ;; enable the /respect/ mode
    (sis-global-respect-mode t)
    ;; enable the /context/ mode for all buffers
    (sis-global-context-mode t)
    ;; enable the /inline english/ mode for all buffers
    (sis-global-inline-mode t)

    (set-face-foreground 'sis-inline-face "gray60")
    )
#+end_src

*** Markup Lanugages
**** Org-Mode
***** Org Babel
#+name: ryo:org-babel
#+headers: :tangle no
#+begin_src elisp
  ;; org-mode and babel
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (lisp       . t)     
     (dot        . t)
     (C          . t)
     (python     . t)    
     (shell      . t)
     (gnuplot    . t)))

  ;; auto display image after babel eval
  (defun ryo:org-babel-display-image-after-eval ()
    "Switch on auto image display after babel eval."
    (interactive)
    (add-hook 'org-babel-after-execute-hook #'org-display-inline-images))

  (defun ryo:org-babel-no-display-image-after-eval ()
    "Swtich off auto image display after babel eval."
    (interactive)
    (remove-hook 'org-babel-after-execute-hook #'org-display-inline-images))

  (ryo:org-babel-display-image-after-eval) ; default on
#+end_src

***** Org Preview
#+name: ryo:org-preview
#+headers: :tangle no
#+begin_src elisp
  ;; org-mode and image preview
  (setf org-image-actual-width nil)

  ;; org-mode and latex preview
  ;; org pretty symbol for raw input
  (setf org-pretty-entities t
        org-pretty-entities-include-sub-superscripts nil)

  ;; Use dvisvgm for SVG preview
  (setf org-preview-latex-default-process 'dvisvgm)  

  ;; Pretty symbol for org-mode
  (defvar ryo:org-prettify-symbols-alist
    '(("\\begin"  . ?▼)
      ("\\end"    . ?▲)
      ("\\mapsto" . ?↦)
      ("\\frac"   . ?𝐟)
      ("\\sqrt"   . ?√)
      ("\\updownarrow" . ?↕)
      ("\\boldsymbol" . ?𝐛)
      ("\\mathrm" . ?𝐫)
      ("\\mathcal" . ?𝐜)))

  (defun ryo:setup-org-pretty-symbol-mode ()
    (setq-local prettify-symbols-alist
                (append prettify-symbols-alist
                        ryo:org-prettify-symbols-alist))
    (prettify-symbols-mode t))

  (add-hook 'org-mode-hook #'ryo:setup-org-pretty-symbol-mode)
#+end_src

