init.el
  (require 'sly-autoloads)

  ;; org-mode babel
  (setf org-babel-lisp-eval-fn #'sly-eval)

  ;; sbcl with larger dynamic space size
  (setf inferior-lisp-program '("sbcl" "--dynamic-space-size" "4GB"))

  ;; add sly-mrepl hook for C-return
  (defun ryo:register-sly-mrepl-key-map ()
    (require 'sly-mrepl)
    (define-key sly-mrepl-mode-map (kbd "RET") nil)
    (define-key sly-mrepl-mode-map (kbd "C-<return>") #'sly-mrepl-return)
    (define-key sly-mrepl-mode-map (kbd "S-<return>") #'sly-mrepl-return))
  (add-hook 'sly-mrepl-mode-hook 'ryo:register-sly-mrepl-key-map)

  ;; some help keys
  (define-key lisp-mode-map (kbd "C-l v") #'sly-describe-symbol)
  (define-key lisp-mode-map (kbd "C-l f") #'sly-describe-function)
  (define-key lisp-mode-map (kbd "C-l c") #'sly-who-calls)
  (define-key lisp-mode-map (kbd "C-l b") #'sly-who-binds))

(use-package company
  :hook (((lisp-mode sly-mrepl-mode) . company-mode)))

;; company with posframe for better UI
(use-package company-posframe
  :hook (((company-mode) . company-posframe-mode)))

(use-package gnu-apl-mode
  :load-path "gnu-apl-mode"
  :config
  (let ((last-output ""))
    (defun org-babel-gnu-apl-capture-output (raw-output)
      (setf last-output (car (string-split raw-output ""))))
    (defun org-babel-execute:gnu-apl (body params)
      (with-temp-buffer
        (gnu-apl-mode)
        (insert body)
        (gnu-apl-interactive-send-string body)
        (gnu-apl-interactive-send-string "⊣⍬\n")
        (mapcar #'split-string (string-split last-output "\n")))))  

  (add-hook 'gnu-apl-interactive-mode-hook
            (lambda ()
              (add-hook 'comint-output-filter-functions
                        'org-babel-gnu-apl-capture-output
                        nil 'local)))

  (defvar org-babel-default-header-args:gnu-apl
    '((:results . "table") (:exports . "results"))
    "Default arguments to use when evaluating a GNU APL source block. "))

(use-package lsp-bridge
  :load-path "lsp-bridge"
  :custom ((lsp-bridge-enable-org-babel t)
           (lsp-bridge-enable-hover-diagnostic t))
  :config

  ;; acm key binding
  (define-key acm-mode-map [tab] nil)
  (define-key acm-mode-map "\t"  nil)

  (global-lsp-bridge-mode))

;; Ensure Python Command
(setf org-babel-python-command
      (cond ((executable-find "python3") "python3")
            ((executable-find "python2") "python2")
            (t "python")))

(setf python-indent-guess-indent-offset nil)

(use-package verilog-mode)

(use-package verilog-ext
  :hook ((verilog-mode . verilog-ext-mode))
  :init
  (setf verilog-ext-feature-list
        '(font-lock
          xref
          capf
          hierarchy
          eglot
          lsp
          flycheck
          beautify
          navigation
          template
          formatter
          compilation
          imenu
          which-func
          hideshow
          typedefs
          time-stamp
          block-end-comments
          ports))
  :config
  (defconst verilog-ext-block-end-keywords-complete-re
    (concat
     ; Blanks and block end keyword
     "^\\(?1:\\s-*" verilog-ext-block-end-keywords-re "\\)\\s-*"
     ; Comments
     ":\\s-*\\(\\(block:\\|" verilog-identifier-sym-re "\\s-*::\\)\\s-*\\)*"
     ; Block name to be replaced
     "\\(?2:" verilog-identifier-sym-re "\\)\\s-*$"))                 

  (defun verilog-ext-block-end-comments-to-names ()
    "Convert valid block-end comments to ': BLOCK_NAME'.

Examples: endmodule // module_name             → endmodule : module_name
          endfunction // some comment          → endfunction // some comment
          endfunction // class_name::func_name → endfunction : func_name
          end // block: block_name             → end : block_name"
    (interactive)
    (save-excursion
      (goto-char (point-min))
      (while (re-search-forward verilog-ext-block-end-keywords-complete-re nil :noerror)
        (when (not (member (match-string-no-properties 2) verilog-keywords))
          (replace-match "\\1 // \\2")))))

  (verilog-ext-mode-setup))

(use-package rime
  :load-path "emacs-rime"
  :custom (default-input-method "rime")
  :config
  (setf rime-user-data-dir  (expand-file-name "rime-ice" user-emacs-directory)
        rime-show-candidate 'posframe)
  (setf rime-disable-predicates
        '(rime-predicate-after-alphabet-char-p
          rime-predicate-punctuation-after-ascii-p
          rime-predicate-org-latex-mode-p
          rime-predicate-prog-in-code-p          
          rime-predicate-tex-math-or-command-p
          rime-predicate-space-after-cc-p
          rime-predicate-in-code-string-p
          rime-predicate-in-code-string-after-ascii-p))
  (when (eq system-type 'darwin)
    (setf rime-librime-root
          (expand-file-name "librime/dist" user-emacs-directory))
    (setf rime-emacs-module-header-root
          "/opt/homebrew/opt/emacs-plus@29/include")))
