README.org
***** Org-Mode with LaTeX Support
#+name: cdlatex-for-equation
#+begin_src elisp
  ;;; Use CDLaTeX for quick LaTeX equation input
  (use-package cdlatex
    :load-path "cdlatex"
    :hook ((org-mode . turn-on-org-cdlatex))
    :config
    (setf cdlatex-math-modify-alist
          '(( ?b "\\boldsymbol" "\\textbf" t nil nil ))))
#+end_src

#+name: auclatex
#+begin_src elisp
  ;;; AUCTeX
  (use-package tex
    :load-path "auctex"
    :ensure auctex)
#+end_src

#+name: ryo:org-latex-config
#+headers: :tangle no
#+begin_src elisp
  ;; set default latex compiler to xelatex
  (setf org-latex-compiler "xelatex")

  ;; add xeCJK for Chinese support
  (add-to-list 'org-latex-packages-alist
               '("" "xeCJK" t ("xelatex")))

  ;; add listing for LaTeX code block
  (setf org-latex-listings 'minted
        org-latex-pdf-process
        '("%latex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "%latex -shell-escape -interaction nonstopmode -output-directory %o %f"
          "%latex -shell-escape -interaction nonstopmode -output-directory %o %f"))
  (add-to-list 'org-latex-packages-alist
               '("" "minted" t ("xelatex")))

  ;; org-mode latex-preview enable
  (plist-put (cdr (assoc 'dvisvgm org-latex-preview-process-alist))
             :image-converter
             '("dvisvgm --page=1- --optimize --clipjoin --relative --no-fonts --bbox=preview -o %B-%%9p.svg %f"))
#+end_src

Using pix2tex as LaTeX math equation OCR backend:

#+name: pix2tex-el
#+begin_src elisp
  (use-package epc)

  (use-package pix2tex-el
    :load-path "pix2tex-el"
    :config
    (setf pix2tex-el-python-path "python3.11")
    (defun ryo:turn-on-pix2tex-el-in-org-mode ()
      (local-set-key (kbd "C-c l") #'pix2tex-el-insert)
      (add-hook 'pix2tex-el-insert-hook #'org-latex-preview 0 nil))
    (add-hook 'org-mode-hook #'ryo:turn-on-pix2tex-el-in-org-mode))
#+end_src

***** Ebib
#+name: ebib
#+begin_src elisp
  (use-package ebib
    :load-path "ebib"
    :bind ("C-c e" . ebib)
    :config
    ;; support for ebib link
    (org-link-set-parameters
     "ebib"
     :follow #'org-ebib-open
     :store  #'org-ebib-store-link
     :export (lambda (&rest args)
               (apply #'org-ref-cite-export (cons "cite" args))))

    (setf org-latex-pdf-process
          '("%latex -interaction nonstopmode -output-directory %o %f"
            "biber %b"                ; make sure to use bibtex backend
            "%latex -interaction nonstopmode -output-directory %o %f"
            "%latex -interaction nonstopmode -output-directory %o %f"))
    (setf (cdr (assoc 'org-mode ebib-citation-commands))
          '((("ebib" "[[ebib:%K]]")))))
#+end_src

***** Org-Mode and File Export
#+name: ox-pandoc
#+begin_src elisp
  (use-package ox-pandoc
    :load-path "ox-pandoc")
#+end_src

***** Pretty Looking
#+name: org-appear
#+begin_src elisp
  (use-package org-appear
    :load-path "org-appear"
    :after org
    :hook ((org-mode . org-appear-mode))
    :config
    (setf org-hide-emphasis-markers t
          org-appear-autolinks      nil
          org-pretty-entities       t
          org-appear-autoentities   t
          org-appear-autokeywords   t))
#+end_src

**** Markdown
#+name: markdown-mode
#+begin_src elisp
  (use-package markdown-mode
    :load-path "markdown-mode"
    :config
    ;; hide markups symbols and urls for better lookings
    (setq-default markdown-hide-markup t
                  markdown-hide-urls   t)

    ;; show code colorized
    (setq-default markdown-fontify-code-blocks-natively t))  
#+end_src

**** Separedit
#+name: separedit-using-org-mode
#+begin_src elisp
  (use-package separedit
    :load-path "separedit"
    :bind (:map prog-mode-map
                ("C-c '" . separedit))
    :config
    (setq separedit-default-mode 'text-mode))
#+end_src

*** Graphic Lanugages
**** Gnuplot
#+name: gnuplot
#+begin_src elisp
  (use-package gnuplot
    :load-path "gnuplot")
#+end_src

** For Reading Documents
*** Docview
#+name: docview
#+begin_src elisp
  (use-package doc-view
    :config
    (setf doc-view-resolution 400))
#+end_src

* Custom
#+name: custom
#+begin_src elisp
  (load-file (expand-file-name "custom.el" user-emacs-directory))
#+end_src

* End Of Init File
#+name: eof
#+begin_src elisp
  (provide 'init)
  ;; init.el ends here
#+end_src
