init.el

;;; Use CDLaTeX for quick LaTeX equation input
(use-package cdlatex
  :load-path "cdlatex"
  :hook ((org-mode . turn-on-org-cdlatex))
  :config
  (setf cdlatex-math-modify-alist
        '(( ?b "\\boldsymbol" "\\textbf" t nil nil ))))

;;; AUCTeX
(use-package tex
  :load-path "auctex"
  :ensure auctex)

(use-package epc)

(use-package pix2tex-el
  :load-path "pix2tex-el"
  :config
  (setf pix2tex-el-python-path "python3.11")
  (defun ryo:turn-on-pix2tex-el-in-org-mode ()
    (local-set-key (kbd "C-c l") #'pix2tex-el-insert)
    (add-hook 'pix2tex-el-insert-hook #'org-latex-preview 0 nil))
  (add-hook 'org-mode-hook #'ryo:turn-on-pix2tex-el-in-org-mode))

(use-package ebib
  :load-path "ebib"
  :bind ("C-c e" . ebib)
  :config
  ;; support for ebib link
  (org-link-set-parameters
   "ebib"
   :follow #'org-ebib-open
   :store  #'org-ebib-store-link
   :export (lambda (&rest args)
             (apply #'org-ref-cite-export (cons "cite" args))))

  (setf org-latex-pdf-process
        '("%latex -interaction nonstopmode -output-directory %o %f"
          "biber %b"                ; make sure to use bibtex backend
          "%latex -interaction nonstopmode -output-directory %o %f"
          "%latex -interaction nonstopmode -output-directory %o %f"))
  (setf (cdr (assoc 'org-mode ebib-citation-commands))
        '((("ebib" "[[ebib:%K]]")))))

(use-package ox-pandoc
  :load-path "ox-pandoc")

(use-package org-appear
  :load-path "org-appear"
  :after org
  :hook ((org-mode . org-appear-mode))
  :config
  (setf org-hide-emphasis-markers t
        org-appear-autolinks      nil
        org-pretty-entities       t
        org-appear-autoentities   t
        org-appear-autokeywords   t))

(use-package markdown-mode
  :load-path "markdown-mode"
  :config
  ;; hide markups symbols and urls for better lookings
  (setq-default markdown-hide-markup t
                markdown-hide-urls   t)

  ;; show code colorized
  (setq-default markdown-fontify-code-blocks-natively t))

(use-package separedit
  :load-path "separedit"
  :bind (:map prog-mode-map
              ("C-c '" . separedit))
  :config
  (setq separedit-default-mode 'text-mode))

(use-package gnuplot
  :load-path "gnuplot")

(use-package doc-view
  :config
  (setf doc-view-resolution 400))

(load-file (expand-file-name "custom.el" user-emacs-directory))

(provide 'init)
;; init.el ends here
